
"""
Задание 3.

Определить, какие из слов «attribute», «класс», «функция», «type»
невозможно записать в байтовом типе с помощью маркировки b'' (без encode decode).

"""

var_task3 = (b'attribute', b'класс', b'функция', b'type')

print(var_task3)

